/*
7. Счетчик объектов
Создайте класс Counter, который хранит количество созданных объектов данного класса.
Реализуйте статическое поле для учета количества объектов и метод для его увеличения
при каждом создании объекта.
*/

class Counter {
    companion object {
        var count = 0
            private set
    }

    init {
        count++
    }
}

fun main() {
    for (i in 1..5) {
        Counter()
    }

    println("Количество созданных объектов: ${Counter.count}")
}
